ones = {0: '', 1: 'один', 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь", 9: "девять"}
tens1 = {10: 'десять', 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}
tens2 = {20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят", 80: "восеьдесят", 90: "девяносто"}
hundreds = {100: "сто", 200: "двести", 300: "триста", 400: "четыреста", 500: "пятьсот", 600: "шестьсот", 700: "семьсот", 800: "восемьсот", 900: "девятьсот"}

translate = {**ones, **tens1, **tens2, **hundreds}

i = int(input())

c = 10
out = []
pastOst = 0
while i:
    ost = i % c
    i -= ost
    c *= 10
    pastOst += ost
    out.append(translate[ost])
    if pastOst >= 10 and pastOst < 20:
        out.pop()
        out.pop()
        out.append(translate[pastOst])
out.reverse()
print(*out)



